/* --------------------------------------------------------------------- */
/* ファイル名	:	ColorConvert.h										 */
/* 機能概要		:														 */
/* 作成日		:   2021/10/21											 */
/* 最終更新日	:   2021/11/03											 */
/* 作成者		:	山田龍之介											 */
/* --------------------------------------------------------------------- */
#pragma once
/* --------------------------------------------------------------------- */
/* includeファイル														 */
/* --------------------------------------------------------------------- */
#include"System.h"
#include"ConvertBmp.h"
/* --------------------------------------------------------------------- */
/* 定数定義																 */
/* --------------------------------------------------------------------- */

//カラー
//bitの定義
#define Bit32 0x0020 
#define Bit24 0x0018
#define Bit8 0x0008
#define Bit1 0x0001

//戻り値
#define FAILE 1
#define SUCCESS 0

/* --------------------------------------------------------------------- */
/* クラス定義                                                            */
/* --------------------------------------------------------------------- */
class ColorConvert
{
public:
	
	SINT exe( FileData*, SINT, SCHR* );


private:
	
	SINT bit1_convert( FileData* );
	SINT bit8_convert( FileData* );
	SINT bit24_convert( FileData* );
	SINT bit32_convert( FileData*, SCHR* );
};

