/* ------------------------------------------------------------------------- */
/* Decorate.cpp																 */
/* 装飾処理																	 */
/* 装飾クラスの最上位クラスなので物置										 */
/* ------------------------------------------------------------------------- */
/* 番号	更新履歴								日付		   氏名			 */
/* ------------------------------------------------------------------------- */
/* 000000	新規作成							2021/10/30     筈尾　辰也	 */
/* 000001	リファクタリング					2021/11/22	   筈尾  辰也	 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* Include																	 */
/* ------------------------------------------------------------------------- */
#include "Decorate.h"

/* ------------------------------------------------------------------------- */
/* 関数名	: Decorate::exe													 */
/* 機能名	: 実行する														 */
/* 機能概要	: 装飾処理を実行する											 */
/* 引数		: DecorateList* : decorateInfo		: 装飾情報[IN]	 			 */
/*			: FileData	 	: imageData			: 画像情報[I/O] 			 */
/*			: FileData		: secondImageData	: 二枚目の装飾情報[I/O] 	 */
/*			: FileData		: thirdImageData	: 三枚目の装飾情報[I/O] 	 */
/*			: FileData	 	: fourthImageData	: 四枚目の装飾情報[I/O] 	 */
/* 戻り値	: SINT			:					: エラーチェック[OUT]		 */
/* 作成日	: 2021/10/30		筈尾  辰也		新規作成					 */
/* ------------------------------------------------------------------------- */
void Decorate::exe( DecorateList* decorateInfo, FileData* imageData,
					FileData* secondImageData, FileData* thirdImageData, FileData* fourthImageData ) {
	/* 置物 */
}
/* ------------------------------------------------------------------------- */
/*              Copyright HAL Collage of Technology & Design                 */
/* ------------------------------------------------------------------------- */
