#pragma once
/* ------------------------------------------------------------------------- */
/* Rotate.h																	 */
/* 画像回転処理																 */
/* クラス定義及び、関数など最低限の情報のみ記載								 */
/* ------------------------------------------------------------------------- */
/* 番号	更新履歴								日付		   氏名			 */
/* 000000	新規作成							2021/10/15     筈尾　辰也	 */
/* 000001	リファクタリング					2021/11/23	   筈尾  辰也	 */
/* ------------------------------------------------------------------------- */
/* Secure 宣言																 */
/* ------------------------------------------------------------------------- */
#define  _CRT_NO_SECURE_WARNINGS
#define  _CRT_SECURE_NO_DEPRECATE

/* ------------------------------------------------------------------------- */
/* Define宣言																 */
/* ------------------------------------------------------------------------- */
#define ONE_PUARTER			1					/* 90度の設定値				 */
#define TWO_PUARTER			2					/* 180度の設定値			 */
#define THREE_PUARTER		3					/* 270度の設定値			 */
#define FOUR_PUARTER		4					/* 360度の設定値			 */

/* ------------------------------------------------------------------------- */
/* 構造体定義																 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* Class定義																 */
/* ------------------------------------------------------------------------- */
class Rotate
{
public:

	SINT exe( DecorateList* decorateInfo, FileData* imageData );

private:
	SINT one_quarter( rgb* Color, FileData* imageData );
	SINT two_quarter( rgb* Color, FileData* imageData );
	SINT three_quarter( rgb* Color, FileData* imageData );
};
/* ------------------------------------------------------------------------- */
/*              Copyright HAL Collage of Technology & Design                 */
/* ------------------------------------------------------------------------- */
