#pragma once
/* ------------------------------------------------------------------------- */
/* Sepia.h																	 */
/* セピア化処理																 */
/* クラス定義及び、関数など最低限の情報のみ記載								 */
/* ------------------------------------------------------------------------- */
/* 番号	更新履歴								日付		   氏名			 */
/* 000000	新規作成							2021/10/15     筈尾　辰也	 */
/* 000001	リファクタリング					2021/11/23	   筈尾  辰也	 */
/* ------------------------------------------------------------------------- */
/* Secure 宣言																 */
/* ------------------------------------------------------------------------- */
#define  _CRT_NO_SECURE_WARNINGS
#define  _CRT_SECURE_NO_DEPRECATE

/* ------------------------------------------------------------------------- */
/* Define宣言																 */
/* ------------------------------------------------------------------------- */
#define DARK	1								/* 暗い						 */
#define NORMAL	2								/* ノーマル					 */
#define DELUTE	3								/* 明るい					 */

#define MAG_DA_B	72.5 / 765					/* 暗いセピアの青の倍率		 */
#define MAG_DA_G	100 / 765					/* 暗いセピアの緑の倍率		 */
#define MAG_DA_R	120 / 765					/* 暗いセピアの赤の倍率		 */

#define MAG_NO_B	108.5 / 765					/* 普通セピアの青の倍率		 */
#define MAG_NO_G	150 / 765					/* 普通セピアの緑の倍率		 */
#define MAG_NO_R	180 / 765					/* 普通セピアの赤の倍率		 */

#define MAG_DE_B	140 / 765					/* 淡いセピアの青の倍率		 */
#define MAG_DE_G	200 / 765					/* 淡いセピアの緑の倍率		 */
#define MAG_DE_R	240 / 765					/* 淡いセピアの赤の倍率		 */
/* ------------------------------------------------------------------------- */
/* 構造体定義																 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* Class定義																 */
/* ------------------------------------------------------------------------- */
class Sepia
{
public:

	SINT exe( DecorateList* decorateInfo, FileData* imageData );

private:
	SINT dark( FileData* imageData );
	SINT normal( FileData* imageData );
	SINT delute( FileData* imageData );
};
/* ------------------------------------------------------------------------- */
/*              Copyright HAL Collage of Technology & Design                 */
/* ------------------------------------------------------------------------- */
